Config/DataProcessors/ИмпортКейса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ИмпортКейса</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресКомплекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьУдалениеОбъектов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьПримечания</Name>
					<Comment>Помимо ошибок и предупреждений выводить также и информацию в журнал регистрации</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/InformationRegisters/УстановленныеКомплектыОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УстановленныеКомплектыОтчетности</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеИзмененийHTML</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИспользуется</Name>
					<Comment>Если Истина, то по умолчанию не будет установлен флаг в загрузке комплекта и не будет оповещать о новой версии</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторКомплекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/DataProcessors/ИмпортКейса/Forms/ФормаЗагрузкиКомплектовИзСервиса/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьТаблицуКомплектовНаСервере(3);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Обработка.ИмпортКейса/ОкончаниеЗагрузки" 
		И ЗначениеЗаполнено(ЗагружаемыйКомплект) Тогда
		Для Каждого СтрТЧ Из ТаблицаКомплектов Цикл
			Если СтрТЧ.ИдентификаторКомплекта = ЗагружаемыйКомплект Тогда
				Если Параметр = Истина Тогда
					СтрТЧ.ТекущаяВерсия = ЗагружаемаяВерсия;
					СтрТЧ.ВерсияПредставление = "Доступна: "+ СтрТЧ.Версия +", установлена: "+СтрТЧ.ТекущаяВерсия;
				КонецЕсли;				
				Если СтрТЧ.Версия = ЗагружаемаяВерсия Тогда
					Если Параметр = Истина Тогда
						СтрТЧ.ПрогрессУстановки = "Установка завершена";
						СтрТЧ.ИндексКартинки = 3;
					Иначе
						СтрТЧ.ПрогрессУстановки = "Ошибка";
						СтрТЧ.ИндексКартинки = 5;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если Параметр = Истина Тогда
			Источник.ЗакрытьФормуБезусловно = Истина;
			Источник.Закрыть();
			ПодключитьОбработчикОжидания("ЗапуститьУстановкуКомплектов",2,Истина);
			//ЗапуститьУстановкуКомплектов();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
//Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы
//Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьТаблицуКомплектов(Команда)
	ЗаполнитьТаблицуКомплектовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДополнительнаяИнформацияОВерсии(Команда)
	ТекДанные = Элементы.ТаблицаКомплектов.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда		
		ПараметрыФормы = Новый Структура("АдресИнформацииОКомплекте", ТекДанные.АдресОписанияИзменений);
		ОткрытьФорму("Обработка.ИмпортКейса.Форма.ИсторияИзмененийКомплекта", ПараметрыФормы, ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуКомплектовНаСервере(Таймаут=Неопределено)
	
	WSПрокси = Справочники.УчетныеЗаписиОбменаСводаОтчетов.ПолучитьWSПроксиОбмена(Параметры.УчетнаяЗапись,Ложь,Таймаут);
	
	ПолученыйРезультат = WSПрокси.GetRepInformation();
	ТаблицаДоступныхКомплектов = ПолученыйРезультат.Получить();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановленныеКомплектыОтчетности.Версия,
		|	УстановленныеКомплектыОтчетности.ИдентификаторКомплекта
		|ИЗ
		|	РегистрСведений.УстановленныеКомплектыОтчетности КАК УстановленныеКомплектыОтчетности";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СоответствиеТекущихВерсий = Новый Соответствие;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СоответствиеТекущихВерсий.Вставить(ВыборкаДетальныеЗаписи.ИдентификаторКомплекта,СтрЗаменить(ВыборкаДетальныеЗаписи.Версия," ",""));		
	КонецЦикла;
	
	ТаблицаКомплектов.Очистить();
	
	Для Каждого СтрТЧ Из ТаблицаДоступныхКомплектов Цикл
		НовСтр = ТаблицаКомплектов.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,СтрТЧ);
		НовСтр.ИндексКартинки = -1;
		НовСтр.ТекущаяВерсия = СоответствиеТекущихВерсий[НовСтр.ИдентификаторКомплекта];
		НовСтр.ВерсияПредставление = "Доступна: "+ НовСтр.Версия +", установлена: "+?(ЗначениеЗаполнено(НовСтр.ТекущаяВерсия),НовСтр.ТекущаяВерсия,"Нет");
		НовСтр.АдресОписанияИзменений = ПоместитьВоВременноеХранилище(СтрТЧ.ОписаниеИзмененийHTML.Получить(),УникальныйИдентификатор);
	КонецЦикла;
	ТаблицаКомплектов.Сортировать("ИдентификаторКомплекта,Версия Убыв");
	
	ТекКомплект = "";
	Для Каждого СтрТЧ Из ТаблицаКомплектов Цикл
		
		Если ТекКомплект = СтрТЧ.ИдентификаторКомплекта Тогда
			Продолжить;
		КонецЕсли;
		//Загружать будем только обновления для ранее установленных комплектов
		Если СтрТЧ.Версия > СтрТЧ.ТекущаяВерсия И ЗначениеЗаполнено(СтрТЧ.ТекущаяВерсия) Тогда
			СтрТЧ.Загрузить = Истина;
		КонецЕсли;
		ТекКомплект = СтрТЧ.ИдентификаторКомплекта;
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ЗагрузитьОтмеченныеКомплекты()
	
	МассивСтрок = ТаблицаКомплектов.НайтиСтроки(Новый Структура("Загрузить",Истина));
	Если МассивСтрок.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Не отмечен ни один комплект для загрузки.'"));
		Возврат Ложь;
	КонецЕсли;
	WSПрокси = Справочники.УчетныеЗаписиОбменаСводаОтчетов.ПолучитьWSПроксиОбмена(Параметры.УчетнаяЗапись);
	
	Для Каждого СтрТЧ Из МассивСтрок Цикл
		ПолученыйРезультат = WSПрокси.GetRepFile(СтрТЧ.ИдентификаторКомплекта,СтрТЧ.Версия);
		СтрТЧ.АдресКомплекта = ПоместитьВоВременноеХранилище(ПолученыйРезультат,УникальныйИдентификатор);	
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура УстановитьОтмеченныеКомплекты(Команда)
	ЕстьКомплекты = ЗагрузитьОтмеченныеКомплекты();
	
	Если ЕстьКомплекты Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПолученияОтвета",ЭтотОбъект);
	
		ПоказатьВопрос(ОписаниеОповещения,Нстр("ru='Для отмеченных комплектов будет выполнена загрузка.
			|Продолжить?'"),РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПолученияОтвета(Результат,ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗапуститьУстановкуКомплектов();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте 
Процедура ЗапуститьУстановкуКомплектов()
	ТекЗагружаемыйКомплект = "";
	ТекЗагружаемаяВерсия = "";
	Для Каждого СтрТЧ Из ТаблицаКомплектов Цикл
		Если СтрТЧ.Загрузить Тогда
			Если НЕ ЗначениеЗаполнено(ТекЗагружаемыйКомплект) Тогда				
				ЗагружаемаяСтрока = СтрТЧ;		
				ТекЗагружаемыйКомплект = СтрТЧ.ИдентификаторКомплекта;
				ТекЗагружаемаяВерсия = СтрТЧ.Версия;
				Продолжить;
			КонецЕсли;
			//Если отмечено несколько версий одного комплекта, то загружать будем сначала старые комплекты
			Если ТекЗагружаемыйКомплект = СтрТЧ.ИдентификаторКомплекта Тогда
				Если ТекЗагружаемаяВерсия>СтрТЧ.Версия Тогда
					ЗагружаемаяСтрока = СтрТЧ;
					ТекЗагружаемаяВерсия = СтрТЧ.Версия;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗагружаемаяСтрока<> Неопределено Тогда
		ЗагружаемаяСтрока.ПрогрессУстановки = "Установка";
		ЗагружаемаяСтрока.ИндексКартинки = 0;
		ЗагружаемаяСтрока.Загрузить = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекЗагружаемыйКомплект) Тогда
		
		ЗагружаемыйКомплект = ТекЗагружаемыйКомплект;
		ЗагружаемаяВерсия = ТекЗагружаемаяВерсия;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("НеВыбиратьФайлы",Истина);
		ПараметрыФормы.Вставить("ЗапускатьЗагрузкуПослеПроверкиТребований",Истина);
		ПараметрыФормы.Вставить("ИмяФайлаКомплектаОтчетности","supplied-data.repx");
        ПараметрыФормы.Вставить("АдресФайлаКомплектаОтчетности",ЗагружаемаяСтрока.АдресКомплекта);
		ПараметрыФормы.Вставить("РазрешитьУдалениеОбъектов",Истина);

		ОткрытьФорму("Обработка.ИмпортКейса.Форма.Форма",ПараметрыФормы,ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
